<a href="https://colab.research.google.com/github/oliveiraqalan/data-manipulation-exercises/blob/master/Manipulacao_de_Dados_Ex_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![](https://i.imgur.com/JsMvGnP.png)


## Exercícios de manipulação de dados - Parte 1

Neste Jupyter notebook você irá resolver uma exercícios utilizando a linguagem Python e a biblioteca Pandas.

Todos os datasets utilizados nos exercícios estão salvos na pasta *datasets*.

Todo o seu código deve ser executado neste Jupyter Notebook. Por fim, se desejar, revise as respostas com o seu mentor.

In [1]:
import pandas as pd

### Passo 1. Importando os dados

Carregue os dados salvos no arquivo ***datasets/users_dataset.csv***.

Esse arquivo possui um conjunto de dados de trabalhadores com 5 colunas separadas pelo símbolo "|" (pipe) e 943 linhas.

Dica: não se esqueça do argumento *sep* quando importar os dados.

In [2]:
users = None # Seu código
col_names =['user_id','age','gender','occupation','zip_code']
users = pd.read_csv('https://raw.githubusercontent.com/oliveiraqalan/data-manipulation-exercises/master/datasets/users_dataset.csv', sep='|',encoding='utf8')

### Passo 2. Mostre as 15 primeiras linhas do dataset.

*Dica: use a função head do DataFrame*

In [3]:
# Seu código
df = pd.DataFrame(users)
df.head(15)

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301

### Passo 3. Mostre as 10 últimas linhas

In [4]:
# Seu código
df.tail(10)

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

### Passo 4. Qual o número de linhas e colunas do DataFrame?

In [23]:
# Seu código
#df.info()
df_rowcol = list(df.shape)
print(f'O número total de linhas do Dataframe é de {df_rowcol[0]} e o número total de colunas é de {df_rowcol[1]}')

O número total de linhas do Dataframe é de 943 e o número total de colunas é de 5

### Passo 5. Mostre o nome de todas as colunas.

In [28]:
# Seu código
list(df.columns)

['user_id', 'age', 'gender', 'occupation', 'zip_code']

### Passo 6. Qual o tipo de dado de cada columa?

In [32]:
# Seu código
df.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Passo 7. Mostre os dados da coluna *occupation*.

In [34]:
# Seu código
# df['occupation'] Series
df[['occupation']] #DataFrame

        occupation
0       technician
1            other
2           writer
3       technician
4            other
..             ...
938        student
939  administrator
940        student
941      librarian
942        student

[943 rows x 1 columns]

### Passo 8. Quantas ocupações diferentes existem neste dataset?

In [56]:
# Seu código
limite = len(set(df['occupation'].unique()))
print(f'Existem', len(set(df['occupation'].unique())), 'ocupações diferentes')

Existem 21 ocupações diferentes

### Passo 9. Qual a ocupação mais frequente?

In [157]:
# Seu código
dados = df['occupation'].value_counts()
print(f'A ocupação mais frequente é', dados.idxmax(), 'com', dados.max(), 'registros')

A ocupação mais frequente é student com 196 registros

### Passo 10. Qual a idade média dos usuários?

In [158]:
# Seu código
print(int(df['age'].mean()), 'anos')
#df.groupby('gender').mean()

34 anos

### Passo 11. Utilize o método describe() para obter diversas informações a respeito do DataFrame.

In [159]:
# Seu código
df.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

**Parabéns! Você chegou ao fim!**